src/main/resources/xsd/student-req.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <GetStudentDetailsRequest xmlns="/student">
            <id>1</id>
        </GetStudentDetailsRequest>
    </Body>
</Envelope>